import unicode

proc toLatin(character: string): string =
    case character
    of "Á", "Ă", "Ắ", "Ặ", "Ằ", "Ẳ", "Ẵ", "Ǎ", "Â", "Ấ", "Ậ", "Ầ", "Ẩ", "Ẫ", "Ä", "Ǟ", "Ȧ", "Ǡ", "Ạ", "Ȁ", "À", "Ả", "Ȃ", "Ā", "Ą", "Å", "Ǻ", "Ḁ", "Ⱥ", "Ã", "Ɐ", "ᴀ":
        "A"
    of "Ꜳ":
        "AA"
    of "Æ", "Ǽ", "Ǣ", "ᴁ":
        "AE"
    of "Ꜵ":
        "AO"
    of "Ꜷ":
        "AU"
    of "Ꜹ", "Ꜻ":
        "AV"
    of "Ꜽ":
        "AY"
    of "Ḃ", "Ḅ", "Ɓ", "Ḇ", "Ƀ", "Ƃ", "ʙ", "ᴃ", "Б":
        "B"
    of "Ć", "Č", "Ç", "Ḉ", "Ĉ", "Ċ", "Ƈ", "Ȼ", "Ꜿ", "ᴄ":
        "C"
    of "Ď", "Ḑ", "Ḓ", "Ḋ", "Ḍ", "Ɗ", "Ḏ", "ǲ", "ǅ", "Đ", "Ð", "Ƌ", "Ꝺ", "ᴅ", "Д":
        "D"
    of "Ǳ", "Ǆ":
        "DZ"
    of "É", "Ĕ", "Ě", "Ȩ", "Ḝ", "Ê", "Ế", "Ệ", "Ề", "Ể", "Ễ", "Ḙ", "Ë", "Ė", "Ẹ", "Ȅ", "È", "Ẻ", "Ȇ", "Ē", "Ḗ", "Ḕ", "Ę", "Ɇ", "Ẽ", "Ḛ", "Ɛ", "Ǝ", "ᴇ", "ⱻ", "Е", "Э":
        "E"
    of "Ꝫ":
        "ET"
    of "Ḟ", "Ƒ", "Ꝼ", "ꜰ", "Ф":
        "F"
    of "Ǵ", "Ğ", "Ǧ", "Ģ", "Ĝ", "Ġ", "Ɠ", "Ḡ", "Ǥ", "Ᵹ", "ɢ", "ʛ", "Г", "Ґ":
        "G"
    of "Ḫ", "Ȟ", "Ḩ", "Ĥ", "Ⱨ", "Ḧ", "Ḣ", "Ḥ", "Ħ", "ʜ", "Х":
        "H"
    of "Í", "Ĭ", "Ǐ", "Î", "Ï", "Ḯ", "İ", "Ị", "Ȉ", "Ì", "Ỉ", "Ȋ", "Ī", "Į", "Ɨ", "Ĩ", "Ḭ", "І", "ɪ", "Й", "Ы", "И":
        "I"
    of "Ꞃ", "Ŕ", "Ř", "Ŗ", "Ṙ", "Ṛ", "Ṝ", "Ȑ", "Ȓ", "Ṟ", "Ɍ", "Ɽ", "ʁ", "ʀ", "ᴙ", "ᴚ", "Р":
        "R"
    of "Ꞅ", "Ś", "Ṥ", "Š", "Ṧ", "Ş", "Ŝ", "Ș", "Ṡ", "Ṣ", "Ṩ", "ꜱ", "С":
        "S"
    of "Ꞇ", "Ť", "Ţ", "Ṱ", "Ț", "Ⱦ", "Ṫ", "Ṭ", "Ƭ", "Ṯ", "Ʈ", "Ŧ", "ᴛ", "Т":
        "T"
    of "Ꝭ":
        "IS"
    of "Ĵ", "Ɉ", "ᴊ":
        "J"
    of "Ḱ", "Ǩ", "Ķ", "Ⱪ", "Ꝃ", "Ḳ", "Ƙ", "Ḵ", "Ꝁ", "Ꝅ", "ᴋ", "К":
        "K"
    of "Ĺ", "Ƚ", "Ľ", "Ļ", "Ḽ", "Ḷ", "Ḹ", "Ⱡ", "Ꝉ", "Ḻ", "Ŀ", "Ɫ", "ǈ", "Ł", "Ꞁ", "ʟ", "ᴌ", "Л":
        "L"
    of "Ǉ":
        "LJ"
    of "Ḿ", "Ṁ", "Ṃ", "Ɱ", "Ɯ", "ᴍ", "М":
        "M"
    of "Ń", "Ň", "Ņ", "Ṋ", "Ṅ", "Ṇ", "Ǹ", "Ɲ", "Ṉ", "Ƞ", "ǋ", "Ñ", "ɴ", "ᴎ", "Н":
        "N"
    of "Ǌ":
        "NJ"
    of "Ó", "Ŏ", "Ǒ", "Ô", "Ố", "Ộ", "Ồ", "Ổ", "Ỗ", "Ö", "Ȫ", "Ȯ", "Ȱ", "Ọ", "Ő", "Ȍ", "Ò", "Ỏ", "Ơ", "Ớ", "Ợ", "Ờ", "Ở", "Ỡ", "Ȏ", "Ꝋ", "Ꝍ", "Ō", "Ṓ", "Ṑ", "Ɵ", "Ǫ", "Ǭ", "Ø", "Ǿ", "Õ", "Ṍ", "Ṏ", "Ȭ", "Ɔ", "ᴏ", "ᴐ", "О":
        "O"
    of "Ƣ":
        "OI"
    of "Ꝏ":
        "OO"
    of "Ȣ", "ᴕ":
        "OU"
    of "Ṕ", "Ṗ", "Ꝓ", "Ƥ", "Ꝕ", "Ᵽ", "Ꝑ", "ᴘ", "П":
        "P"
    of "Ꝙ", "Ꝗ":
        "Q"
    of "ß":
        "ss"
    of "Ʌ", "Ꝟ", "Ṿ", "Ʋ", "Ṽ", "ᴠ", "В":
        "V"
    of "Ꜩ":
        "TZ"
    of "Ú", "Ŭ", "Ǔ", "Û", "Ṷ", "Ü", "Ǘ", "Ǚ", "Ǜ", "Ǖ", "Ṳ", "Ụ", "Ű", "Ȕ", "Ù", "Ủ", "Ư", "Ứ", "Ự", "Ừ", "Ử", "Ữ", "Ȗ", "Ū", "Ṻ", "Ų", "Ů", "Ũ", "Ṹ", "Ṵ", "ᴜ", "У":
        "U"
    of "Ꝡ":
        "VY"
    of "Ẃ", "Ŵ", "Ẅ", "Ẇ", "Ẉ", "Ẁ", "Ⱳ", "ᴡ":
        "W"
    of "Ẍ", "Ẋ":
        "X"
    of "Ý", "Ŷ", "Ÿ", "Ẏ", "Ỵ", "Ỳ", "Ƴ", "Ỷ", "Ỿ", "Ȳ", "Ɏ", "Ỹ", "ʏ":
        "Y"
    of "Ї":
        "YI"
    of "Ź", "Ž", "Ẑ", "Ⱬ", "Ż", "Ẓ", "Ȥ", "Ẕ", "Ƶ", "ᴢ", "З":
        "Z"
    of "Þ":
        "TH"
    of "Ĳ":
        "IJ"
    of "Œ", "ɶ":
        "OE"
    of "á", "ă", "ắ", "ặ", "ằ", "ẳ", "ẵ", "ǎ", "â", "ấ", "ậ", "ầ", "ẩ", "ẫ", "ä", "ǟ", "ȧ", "ǡ", "ạ", "ȁ", "à", "ả", "ȃ", "ā", "ą", "ᶏ", "ẚ", "å", "ǻ", "ḁ", "ⱥ", "ã", "ɐ", "ₐ", "А", "а":
        "a"
    of "ꜳ":
        "aa"
    of "æ", "ǽ", "ǣ", "ᴂ":
        "ae"
    of "ꜵ":
        "ao"
    of "ꜷ":
        "au"
    of "ꜹ", "ꜻ":
        "av"
    of "ꜽ":
        "ay"
    of "ḃ", "ḅ", "ɓ", "ḇ", "ᵬ", "ᶀ", "ƀ", "ƃ", "б":
        "b"
    of "ɵ", "ó", "ŏ", "ǒ", "ô", "ố", "ộ", "ồ", "ổ", "ỗ", "ö", "ȫ", "ȯ", "ȱ", "ọ", "ő", "ȍ", "ò", "ỏ", "ơ", "ớ", "ợ", "ờ", "ở", "ỡ", "ȏ", "ꝋ", "ꝍ", "ⱺ", "ō", "ṓ", "ṑ", "ǫ", "ǭ", "ø", "ǿ", "õ", "ṍ", "ṏ", "ȭ", "ɔ", "ᶗ", "ᴑ", "ᴓ", "ₒ", "о":
        "o"
    of "ć", "č", "ç", "ḉ", "ĉ", "ɕ", "ċ", "ƈ", "ȼ", "ↄ", "ꜿ":
        "c"
    of "ď", "ḑ", "ḓ", "ȡ", "ḋ", "ḍ", "ɗ", "ᶑ", "ḏ", "ᵭ", "ᶁ", "đ", "ɖ", "ƌ", "ð", "ꝺ", "д":
        "d"
    of "ı", "í", "ĭ", "ǐ", "î", "ï", "ḯ", "ị", "ȉ", "ì", "ỉ", "ȋ", "ī", "į", "ᶖ", "ɨ", "ĩ", "ḭ", "і", "ᴉ", "ᵢ", "й", "ы", "и":
        "i"
    of "ȷ", "ɟ", "ʄ", "ǰ", "ĵ", "ʝ", "ɉ", "ⱼ":
        "j"
    of "ǳ", "ǆ":
        "dz"
    of "é", "ĕ", "ě", "ȩ", "ḝ", "ê", "ế", "ệ", "ề", "ể", "ễ", "ḙ", "ë", "ė", "ẹ", "ȅ", "è", "ẻ", "ȇ", "ē", "ḗ", "ḕ", "ⱸ", "ę", "ᶒ", "ɇ", "ẽ", "ḛ", "ɛ", "ᶓ", "ɘ", "ǝ", "ₑ", "е", "э":
        "e"
    of "ꝫ":
        "et"
    of "ḟ", "ƒ", "ᵮ", "ᶂ", "ꝼ", "ф":
        "f"
    of "ǵ", "ğ", "ǧ", "ģ", "ĝ", "ġ", "ɠ", "ḡ", "ᶃ", "ǥ", "ᵹ", "ɡ", "ᵷ", "г", "ґ":
        "g"
    of "ḫ", "ȟ", "ḩ", "ĥ", "ⱨ", "ḧ", "ḣ", "ḥ", "ɦ", "ẖ", "ħ", "ɥ", "ʮ", "ʯ", "х":
        "h"
    of "ƕ":
        "hv"
    of "ꞃ", "ŕ", "ř", "ŗ", "ṙ", "ṛ", "ṝ", "ȑ", "ɾ", "ᵳ", "ȓ", "ṟ", "ɼ", "ᵲ", "ᶉ", "ɍ", "ɽ", "ɿ", "ɹ", "ɻ", "ɺ", "ⱹ", "ᵣ", "р":
        "r"
    of "ꞅ", "ſ", "ẜ", "ẛ", "ẝ", "ś", "ṥ", "š", "ṧ", "ş", "ŝ", "ș", "ṡ", "ṣ", "ṩ", "ʂ", "ᵴ", "ᶊ", "ȿ", "с":
        "s"
    of "ꞇ", "ť", "ţ", "ṱ", "ț", "ȶ", "ẗ", "ⱦ", "ṫ", "ṭ", "ƭ", "ṯ", "ᵵ", "ƫ", "ʈ", "ŧ", "ʇ", "т":
        "t"
    of "ꝭ":
        "is"
    of "ḱ", "ǩ", "ķ", "ⱪ", "ꝃ", "ḳ", "ƙ", "ḵ", "ᶄ", "ꝁ", "ꝅ", "ʞ", "к":
        "k"
    of "ĺ", "ƚ", "ɬ", "ľ", "ļ", "ḽ", "ȴ", "ḷ", "ḹ", "ⱡ", "ꝉ", "ḻ", "ŀ", "ɫ", "ᶅ", "ɭ", "ł", "ꞁ", "л":
        "l"
    of "ǉ":
        "lj"
    of "ḿ", "ṁ", "ṃ", "ɱ", "ᵯ", "ᶆ", "ɯ", "ɰ", "м":
        "m"
    of "ń", "ň", "ņ", "ṋ", "ȵ", "ṅ", "ṇ", "ǹ", "ɲ", "ṉ", "ƞ", "ᵰ", "ᶇ", "ɳ", "ñ", "н":
        "n"
    of "ǌ":
        "nj"
    of "ƣ":
        "oi"
    of "ꝏ":
        "oo"
    of "ȣ":
        "ou"
    of "ṕ", "ṗ", "ꝓ", "ƥ", "ᵱ", "ᶈ", "ꝕ", "ᵽ", "ꝑ", "п":
        "p"
    of "ꝙ", "ʠ", "ɋ", "ꝗ":
        "q"
    of "ᴝ", "ú", "ŭ", "ǔ", "û", "ṷ", "ü", "ǘ", "ǚ", "ǜ", "ǖ", "ṳ", "ụ", "ű", "ȕ", "ù", "ủ", "ư", "ứ", "ự", "ừ", "ử", "ữ", "ȗ", "ū", "ṻ", "ų", "ᶙ", "ů", "ũ", "ṹ", "ṵ", "ᵤ", "у":
        "u"
    of "ᵺ", "þ":
        "th"
    of "ᴔ", "œ":
        "oe"
    of "ʌ", "ⱴ", "ꝟ", "ṿ", "ʋ", "ᶌ", "ⱱ", "ṽ", "ᵥ", "в":
        "v"
    of "ʍ", "ẃ", "ŵ", "ẅ", "ẇ", "ẉ", "ẁ", "ⱳ", "ẘ":
        "w"
    of "ʎ", "ý", "ŷ", "ÿ", "ẏ", "ỵ", "ỳ", "ƴ", "ỷ", "ỿ", "ȳ", "ẙ", "ɏ", "ỹ":
        "y"
    of "ꜩ":
        "tz"
    of "ᵫ":
        "ue"
    of "ꝸ":
        "um"
    of "ꝡ":
        "vy"
    of "ẍ", "ẋ", "ᶍ", "ₓ":
        "x"
    of "ї":
        "yi"
    of "ź", "ž", "ẑ", "ʑ", "ⱬ", "ż", "ẓ", "ȥ", "ẕ", "ᵶ", "ᶎ", "ʐ", "ƶ", "ɀ", "з":
        "z"
    of "ﬀ":
        "ff"
    of "ﬃ":
        "ffi"
    of "ﬄ":
        "ffl"
    of "ﬁ":
        "fi"
    of "ﬂ":
        "fl"
    of "ĳ":
        "ij"
    of "ﬆ":
        "st"
    of "Ё":
        "YO"
    of "Ц":
        "TS"
    of "Ш":
        "SH"
    of "Щ":
        "SCH"
    of "Ъ", "ъ", "Ь", "ь":
        "'"
    of "ё":
        "yo"
    of "ц":
        "ts"
    of "ш":
        "sh"
    of "щ":
        "sch"
    of "Ж":
        "ZH"
    of "ж":
        "zh"
    of "Я":
        "Ya"
    of "Ч":
        "CH"
    of "Ю":
        "YU"
    of "я":
        "ya"
    of "ч":
        "ch"
    of "ю":
        "yu"
    else: character

proc translate*(s: string): string =

    for rune in s.toRunes:
        result.add(rune.toUTF8.toLatin)
